Revit 2026 API

# UVAddition Operator

---

Adds the two specified 2-D vectors and returns the result.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static UV operator +(
	UV left,
	UV right
)
```
```vb
Public Shared Operator + (
	left As UV,
	right As UV
) As UV
```
```cpp
public:
static UV^ operator +(
	UV^ left,
	UV^ right
)
```
```fsharp
static let inline (+)
        left : UV *
        right : UV  : UV
```

#### Parameters

left UV
    The first vector.
right UV
    The second vector.

#### Return Value

UVThe 2-D vector equal to the sum of the two source vectors.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when left or right is . |

The added vector is obtained by adding each coordinate of the right vector to the corresponding coordinate of the left vector.

#### Reference

UV Class

Autodesk.Revit.DB Namespace